##Сазонтова Мария (Вариант 7)
##Б9119-09.03.04прогин(1)
##ИДЗ-3
clear all
A=[29 8 9 -9; -7 -25 0 9; 1 6 16 -2; -7 4 -2 17 ]; 
B=[197 -226 -95 -58];
n=4;

##------------------------------------------------------------------------------
##---------------------------часть1 - метод Якоби-------------------------------


X=zeros(n,1);
x0=zeros(n,1);
k=0;
##Максимальное количество итераций
N=100; 
##точность eps
E = 0.00001; 
noE=false;
printf("1 часть\n\n")

while (k<N && noE==false)

    for i=1:1:n
        j=[1:i-1,i+1:n];
        X(i)=(B(i)-A(i,j)*x0(j))/A(i,i);
    end
    if (abs(max(X-x0))<=E)
        noE=true;
        break;
    end
    x0=X;
    k++;
end

format long 
X
printf("Количество итераций:   ")
k
printf("\n\n")

##------------------------------------------------------------------------------
##------------------------------------------------------------------------------
##---------------------------часть2 - метод Гаусса-Зейделя----------------------


X1=zeros(n,1);
X0=zeros(n,1);
k1=0;
##Максимальное кол-во итераций
N1=100; 
##точность eps
E1 = 0.00001; 
enough=false;
printf("2 часть\n\n")

while (k1<N1 && enough==false)
    k1++;
    for i=1:1:n
      j=[1:i-1,i+1:n];
      X1(i)=(B(i)-A(i,j)*X1(j))/A(i,i);
    end
    if (abs(max(X1-X0))<E1)
      enough=true;
      break;
    end
    X0 = X1;
end
format long
X1
printf("Количество итераций:   ")
k1
