##Сазонтова Мария
##Б9119 09.03.04прогин(1)
##Вариант 7
##ИДЗ-3


clear all;


A = [ 15   8   0   0  0 ;
       2 -15   4   0  0 ; 
       0   4  11   5  0 ; 
       0   0  -3  16 -7 ; 
       0   0   0   3  8 ];
     
B = [  92 ; 
      -84 ; 
      -77 ; 
       15 ; 
      -11 ];

n = 5;
      
X = A^(-1)*B;
b = [0 -7 4 -4 -1];
c = [16 -16 12 12 7];
d = [-8 5 3 -7 0];
r = [0 -123 -68 104 20];

delta(1) = -d(1)/c(1);
lamda(1) = r(1)/c(1);

for i = 2:1:n
    delta(i) = -d(i)/(b(i)*delta(i-1)+c(i));
    lamda(i) = (r(i)-b(i)*lamda(i-1))/(b(i)*delta(i-1)+c(i));
end;

x(n) = lamda(n);

for i = (n-1):(-1):1
    x(i) = delta(i)*x(i+1)+lamda(i);
end;
printf("Решение СЛАУ методом прогонки:\n")
x