# численное диффиренцирование
clear all
format long
# лЄгкий способ // не эффективный
x= [0 0.1 0.2 0.3 0.4]' ;
y = sin(x)
for i=0:0.1:0.4
sin(i)
endfor;

for i=0:0.1:0.4
cos(i)
endfor

y = (sin(0.3) - sin(0.2))*10 #f'(x) = (f(x+dx) - f(x)/dx + O(dx) || f(x+dx)
y = (sin(0.2) - sin(0.1))*10 #f'(x) = (f(x) - f(x-dx))/dx +O(dx) || f(x-dx) // —хема центральной разности

y = (sin(0.3) - sin(0.1))*5 #f'(x) = (f(x+dx) - f(x-dx))/2dx + O(dx^2) || f(x+dx) - f(x-dx) //

y = (sin(0.3) - 2*sin(0.2) + sin(0.1)) * 100 # f''(x) = (f(x+dx) - 2f(x) + f(x-dx))/(dx)^2 || f(x+dx) + f(x-dx)


# т€жЄлый способ // через интерпол€цию (полиномиальна€ || ч/з Ќьютона)
x1 = [0 0.1 0.2 0.3 0.4]' ;
y1 = sin(x1);
n1 = 5;
dy1(1:1:n1, 1:1:n1) = 0;
dy1(:,1) = y1;

for j1=2:1:n1
for i1=1:1:(n1-j1+1)
dy1(i1,j1) = dy1(i1+1,j1-1) - dy1(i1,j1-1);
endfor
endfor
dy1
y1 = 1/0.1*(dy1(1,2) + 3*dy1(1,3)/2 + 2*dy1(1,4)/6 - 2*dy1(1,5)/24)