##Интерполяция - процедура восстановления функции по известным значениям, 
##например, Полином по некотырым точкам.
##1. Прямой метод
##2. Полином Лагранжа
##3. Полином Ньютона 


##Метод Ньютона

clear all
n=6
dx=1;
x=[1 2 3 4 5 6]';
y=[2 2 1 3 1 2]';
x0=3,5;
dy=zeros(n,n);
dy(:,1)=y;
for j=2:1:n
for i=1:1:(n-j+1)
dy(i,j)=(dy(i+1,j-1)-dy(i,j-1))/(x(j+i-1)-x(i));
endfor
endfor

sum=0;
for i=1:1:n
pr=1;
for j=1:1:(i-1)
pr=pr*(x0-x(j));
endfor
sum=sum+dy(1,i)*pr;
endfor
sum