#Б9119-09.03.04прогин Сазонтова Мария
#7. y(x) = sqrt(x)
#Найти значение определенного интеграла при помощи составных квадратурных формул Ньютона-Котеса 0-4 порядков.

clear all;
format long;
output_precision(15);


dx = 0.001;##чем меньше шаг(dx), тем меньше ошибка
x = [6: dx: 18];
y = sqrt(x);
n = length(x)


dx * sum(y(1:1:(n - 1))) #ф-ла 0-го порядка
(dx/2) * (y(1) + y(n) + 2 * sum(y(2:1:(n - 1)))) #1-го порядка
(dx/3) * (y(1) + y(n) + 4*sum(y(2:2:n-1)) + 2*sum(y(3:2:n-2)))  # 2-го порядка
((3*dx)/8) * (y(1) + y(n) - sum(y(4:3:n-3)) + 3*sum(y(2:1:(n-1)))) #3-го порядка
((2*dx)/45) * (7*(y(1)+y(n))+12*sum(y(2:4:n-2))+14*sum(y(4:4:n-4))+32*sum(y(1:2:n-1))) #4-го порядка