#Б9119-09.03.04прогин Сазонтова Мария
#7. y(x) = sqrt(x)
#Найти значение определенного интеграла при помощи квадратурных формул НьютонаКотеса 0-4 порядков.

clear all;
format long;
output_precision(15);

n = 5;
x = [6 9 12 15 18]';
dx = 3;
for i = 1:1:n
  y(i) = sqrt(x(i));
endfor
y;

#ф-ла 0 порядка
dx*y(1) #dx*f0

#ф-ла 1 порядка 
(dx/2)*(y(2)+y(1)) #dx/2 * (f1+f0)

#ф-ла 2 порядка
(dx/3)*(y(1) + 4*y(2) + y(3))#dx/3 * (f0 + 4f1 + f2)

#ф-ла 3 порядка
((3*dx)/8)*(y(1) + 3*y(2) + 3*y(2) + y(4)) #(3*dx)/8 * (f0 + 3f1 + 3*f2 + f3)

#ф-ла 4 порядка
((2*dx)/45)*(7*y(1) + 32*y(2) + 12*y(3) + 32*y(4) + 7*y(5)) #(2*dx)/45 * (7*f0 + 32*f1 + 12*f2 + 32*f3 + 7*f4)
